# WRITE  BY BATT
# PLUGIN FOR BATT 
# @angthon

from telethon import events
import random, re
from ..Config import Config

from BATT.utils import admin_cmd

import asyncio
from BATT import lucmd9
from random import choice

from ..core.managers import edit_or_reply
from ..sql_helper.globals import gvarstatus

plugin_category = "extra"
ALLOWED_USERS = [1045489068,6262533559,5762222122]
rehu = [
    "𝓢𝓾𝓬𝓬𝓮𝓼𝓼 𝓲𝓼 𝓷𝓸𝓽 𝓯𝓲𝓷𝓪𝓵, 𝓯𝓪𝓲𝓵𝓾𝓻𝓮 𝓲𝓼 𝓷𝓸𝓽 𝓯𝓪𝓽𝓪𝓵: 𝓘𝓽 𝓲𝓼 𝓽𝓱𝓮 𝓬𝓸𝓾𝓻𝓪𝓰𝓮 𝓽𝓸 𝓬𝓸𝓷𝓽𝓲𝓷𝓾𝓮 𝓽𝓱𝓪𝓽 𝓬𝓸𝓾𝓷𝓽𝓼.✨🌟",
    "𝓣𝓱𝓮 𝓸𝓷𝓵𝔂 𝔀𝓪𝔂 𝓽𝓸 𝓭𝓸 𝓰𝓻𝓮𝓪𝓽 𝔀𝓸𝓻𝓴 𝓲𝓼 𝓽𝓸 𝓵𝓸𝓿𝓮 𝔀𝓱𝓪𝓽 𝔂𝓸𝓾 𝓭𝓸",
    "𝓑𝓮𝓵𝓲𝓮𝓿𝓮 𝔂𝓸𝓾 𝓬𝓪𝓷 𝓪𝓷𝓭 𝔂𝓸𝓾'𝓻𝓮 𝓱𝓪𝓵𝓯𝔀𝓪𝔂 𝓽𝓱𝓮𝓻𝓮.",
    "𝓘𝓷 𝓽𝓱𝓮 𝓶𝓲𝓭𝓭𝓵𝓮 𝓸𝓯 𝓭𝓲𝓯𝓯𝓲𝓬𝓾𝓵𝓽𝔂 𝓵💯💢",
    "𝘾𝙊𝘿𝙄𝙉𝙂 𝙄𝙎 𝙉𝙊𝙏 𝙅𝙐𝙎𝙏 𝘼𝘽𝙊𝙐𝙏 𝙒𝙍𝙄𝙏𝙄𝙉𝙂 𝙇𝙄𝙉𝙀𝙎 𝙊𝙁 𝘾𝙊𝘿𝙀𝙄𝙏𝙎 𝘼𝘽𝙊𝙐𝙏 𝘾𝙍𝙀𝘼𝙏𝙄𝙉𝙂 𝘼 𝙉𝙀𝙒 𝙒𝙊𝙍𝙇𝘿",
    "𝗧𝗛𝗘 𝗕𝗘𝗦𝗧 𝗘𝗥𝗥𝗢𝗥 𝗠𝗘𝗦𝗦𝗔𝗚𝗘 𝗜𝗦 𝗧𝗛𝗘 𝗢𝗡𝗘 𝗧𝗛𝗔𝗧 𝗡𝗘𝗩𝗘𝗥 𝗦𝗛𝗢𝗪𝗦 𝗨𝗣 𝗕𝗘𝗖𝗔𝗨𝗦𝗘 𝗬𝗢𝗨 𝗪𝗥𝗢𝗧𝗘 𝗙𝗟𝗔𝗪𝗟𝗘𝗦𝗦 𝗖𝗢𝗗𝗘💥🌟",
    "",
    "𝓣𝓱𝓮 𝓱𝓪𝓻𝓭𝓮𝓻 𝔂𝓸𝓾 𝔀𝓸𝓻𝓴 𝓯𝓸𝓻 𝓼𝓸𝓶𝓮𝓽𝓱𝓲𝓷𝓰, 𝓽𝓱𝓮 𝓰𝓻𝓮𝓪𝓽𝓮𝓻 𝔂𝓸𝓾'𝓵𝓵 𝓯𝓮𝓮𝓵 𝔀𝓱𝓮𝓷 𝔂𝓸𝓾 𝓪𝓬𝓱𝓲𝓮𝓿𝓮 𝓲𝓽.💫",
    "𝓣𝓱𝓮 𝓯𝓾𝓽𝓾𝓻𝓮 𝓫𝓮𝓵𝓸𝓷𝓰𝓼 𝓽𝓸 𝓽𝓱𝓸𝓼𝓮 𝔀𝓱𝓸 𝓫𝓮𝓵𝓲𝓮𝓿𝓮 𝓲𝓷 𝓽𝓱𝓮 𝓫𝓮𝓪𝓾𝓽𝔂 𝓸𝓯 𝓽𝓱𝓮𝓲𝓻 𝓭𝓻𝓮𝓪𝓶𝓼🦇.",
    "𝓣𝓱𝓮 𝓯𝓾𝓽𝓾𝓻𝓮 𝓫𝓮𝓵𝓸𝓷𝓰𝓼 𝓽𝓸 𝓽𝓱𝓸𝓼𝓮 𝔀𝓱𝓸 𝓫𝓮𝓵𝓲𝓮𝓿𝓮 𝓲𝓷 𝓽𝓱𝓮 𝓫𝓮𝓪𝓾𝓽𝔂 𝓸𝓯 𝓽𝓱𝓮𝓲𝓻 𝓭𝓻𝓮𝓪𝓶𝓼.⭐",
    "𝐏𝐑𝐎𝐆𝐑𝐀𝐌𝐌𝐈𝐍𝐆 𝐈𝐒 𝐋𝐈𝐊𝐄 𝐒𝐎𝐋𝐕𝐈𝐍𝐆 𝐀 𝐏𝐔𝐙𝐙𝐋𝐄, 𝐖𝐇𝐄𝐑𝐄 𝐄𝐕𝐄𝐑𝐘 𝐋𝐈𝐍𝐄 𝐎𝐅 𝐂𝐎𝐃𝐄 𝐈𝐒 𝐀 𝐏𝐈𝐄𝐂𝐄 𝐓𝐇𝐀𝐓 𝐅𝐈𝐓𝐒 𝐏𝐄𝐑𝐅𝐄𝐂𝐓𝐋𝐘.",
]
@lucmd9.ar_cmd(pattern="الاوامر(?:\s|$)([\s\S]*)")
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        SX9OO = random.choice(rehu)
        await event.edit(
        f"• قـائـمـة اوامـر سـورس الخفاش\n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n〈`.م1`〉⇦اوامـر الأدمـن\n〈`.م2`〉⇦ اوامـر الـمـجـمـوعـة\n〈`.م3`〉  ⇦ اوامـر الـتـرحـيـب و الردود\n〈`.م4`〉 ⇦ حـمـاية خـاص والتـلـغـراف\n〈`.م5`〉  ⇦ اوامـر الـمـنـشـن و الانـتـحـال\n〈`.م6`〉 ⇦ اوامـر الـتـحـمـيـل\n〈`.م7`〉 ⇦ اوامـر الـمـنـع و الـقـفـل\n〈`.م8`〉  ⇦ اوامـر الـتـنـظـيـف و الـتـكـرار\n〈`.م9`〉 ⇦ اوامـر الـفـارات\n〈`.م10`〉⇦اوامـر الـوقـتـي و الـتـشـغـيـل\n〈`.م11`〉 ⇦ اوامـر الـكـشـف و الـروابـط\n〈`.م12`〉 ⇦ اوامـر الـمـساعـدة والإذاعـة\n〈`.م13`〉 ⇦ اوامـر الارسـال والاذكـار\n〈`.م14`〉 ⇦ اوامـر الـمــصـقـات وكـوكـل\n〈`.م15`〉 ⇦ اوامـر الـتسـلـيـة و المـيـمـز\n〈`.م16`〉⇦ اوامـر الصـيـغ والـجـهـات\n〈`.م17`〉⇦ اوامـر الـتـمـبلـر والزغـرفة\n〈`.م18`〉 ⇦اوامـر الـحـسـاب والـترفـيـه\n〈`.م19`〉 ⇦ اوامـر الـمـيـوزك\n〈`.م20`〉 ⇦ اوامـر بـصـمـات الـمـيـمـز\n〈`.م21`〉 ⇦ اوامـر تـجـمـيـع الـنـقـاط\n〈`.م22`〉 ⇦ اوامـر الصيد  \n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n{SX9OO}")

@lucmd9.ar_cmd(
    pattern="م1$",
    command=("م1", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الادمن لسورس الخفاش **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الحظر` )\n- ( `.اوامر الكتم` )\n- ( `.اوامر التثبيت` )\n- ( `.اوامر الاشراف` )\n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)
		
@lucmd9.ar_cmd(
    pattern="م2$",
    command=("م2", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر المجـموعه لسورس الخفاش **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التفليش` )\n- ( `.اوامر المحذوفين` )\n- ( `.اوامر الكروب` )\n- ( `.اوامر السب` )\n\n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)

@lucmd9.ar_cmd(
    pattern="م3$",
    command=("م3", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الـترحيب والـردود **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الترحيب` )\n- ( `.اوامر الردود` )\n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)
@lucmd9.ar_cmd(
    pattern="م4$",
    command=("م4", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر حـماية الخاص والتلكراف **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الحماية` )\n- ( `.اوامر التلكراف` ) \n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)
@lucmd9.ar_cmd(
    pattern="م5$",
    command=("م5", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الـمنشن والانتحال **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الانتحال` )\n- ( `.اوامر التقليد` )\n- ( `.اوامر المنشن` ) \n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)

@lucmd9.ar_cmd(
    pattern="م6$",
    command=("م6", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر التحميل والترجمه **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر النطق` )\n- ( `.اوامر التحميل` )\n- ( `.اوامر الترجمة` ) \n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)

@lucmd9.ar_cmd(
    pattern="م7$",
    command=("م7", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر القفل والمنع **:\n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر القفل` )\n- ( `.اوامر الفتح` )\n- ( `.اوامر المنع` ) \n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)

@lucmd9.ar_cmd(
    pattern="م8$",
    command=("م8", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر التكرار والتنظيف **:\n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التكرار` )\n- ( `.اوامر السبام` )\n- ( `.اوامر التنظيف` ) \n- ( `.اوامر المسح` ) \n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)

@lucmd9.ar_cmd(
    pattern="م9$",
    command=("م9", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة التخصيص والفارات **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التخصيص` )\n لتغير الصور والكلايش كل من الحماية والفحص والبنك\n- ( `.اوامر الفارات` )\n - لتغير الاسم وزخرفة الوقت والصورة الوقتية والمنطقة الزمنية ورمز الاسم والبايو الوقتي وغيرها\n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
		)

@lucmd9.ar_cmd(
    pattern="م10$",
    command=("م10", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الوقتي والتشغيل **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الاسم` )\n- ( `.اوامر البايو` )\n- ( `.اوامر الكروب الوقتي` )\n- ( `.اوامر التشغيل` ) \n- ( `.اوامر الاطفاء` ) \n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)	

@lucmd9.ar_cmd(
    pattern="م11$",
    command=("م11", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الكـشف و الروابط **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الكشف` )\n- ( `.اوامر الروابط` ) \n\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)
@lucmd9.ar_cmd(
    pattern="م12$",
    command=("م12", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر المساعدة  **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الوقت والتاريخ` )\n- ( `.اوامر كورونا` )\n- ( `.اوامر الصلاة` ) \n- ( `.اوامر مساعدة` )\n- ( `.اوامر الاذاعه` ) \n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)
@lucmd9.ar_cmd(
    pattern="م13$",
    command=("م13", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الارسال **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.امر الصورة الذاتية` )\n- ( `.اوامر التحذيرات` )\n- ( `.اوامر اللستة` )\n- ( `.اوامر الملكية` ) \n- ( `.اوامر السليب` ) \n- ( `.اوامر الاذكار` )\n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)
@lucmd9.ar_cmd(
    pattern="م14$",
    command=("م14", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الملصقات وكوكل **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الملصقات` )\n- ( `.اوامر كوكل` )\n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)

@lucmd9.ar_cmd(
    pattern="م15$",
    command=("م15", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر التسلية والتحشيش **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التسلية` )\n- ( `.اوامر التحشيش` )\n- ( `.اوامر الميمز` )\n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)

@lucmd9.ar_cmd(
    pattern="م16$",
    command=("م16", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر تحويل الصيغ و الجهات **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التحويل` )\n- ( `.اوامر الجهات` ) \n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
)

@lucmd9.ar_cmd(
    pattern="م18$",
    command=("م18", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الحساب و الترفيه **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الترفيه` )\n- ( `.اوامر الحساب` ) \n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"

)

@lucmd9.ar_cmd(
    pattern="م19",
    command=("م19", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر الميوزك والتشغيل 🎵\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n᯽︙ اختر احدى هذه الاوامر\n ᯽︙ قبل أستخدام هذه الاوامر يجب تفعيل المود بكتابة ألامر ( `.ميوزك تفعيل` ) \n- ( `.تشغيل_المكالمة` )\n- لتشغيل المحادثة الصوتيه\n- ( `.انهاء_المكالمة` )\n-لأنهاء المحادثه الصوتية \n- ( `.دعوة` )\n- بالرد على الشخص لدعوته الى المكالمة \n- ( `.معلومات_المكالمة` )\n- لعرض عنوان المكالمة وعدد لاشخاص الموجودين فيها \n- ( `.تسمية_المكالمة` )\n- لتغير عنوان المكالمة \n- ( `.انضمام` )\n- للأنضمام الى المحادثة الصوتية\n- ( `.مغادرة` )\n- لمغادرة المحادثة الصوتية \n- ( `.تشغيل` )\n-بالرد على رابط اليوتيوب او كتابة الامر مع رابط ليوتيوب لتشغيل الاغنيه \n- ( `.قائمة_التشغيل` )\n- لعرض قائمة التشغيل \n- ( `.ايقاف_مؤقت` )\n - لأيقاف الاغنية الحالية مؤقتا \n- ( `.استمرار` )\n -لأستمرار الاغنيه التي تم ايقافها \n- ( `.تخطي` )\n- لتخطي الاغنيه وتشغيل الاغنيه الموجوده في قائمة التشغيل \n\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"



)

@lucmd9.ar_cmd(
    pattern="م20$",
    command=("م20", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر بصمات الميمز **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.بصمات ميمز` )\n- ( `.بصمات ميمز2` )\n- ( `.بصمات ميمز3` )\n- ( `.بصمات ميمز4` )\n- ( `.بصمات ميمز5` )\n- ( `.بصمات انمي` ) \n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"

)

@lucmd9.ar_cmd(
    pattern="م21$",
    command=("م21", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر تجميع النقاط **:\n ✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التجميع` ) \n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"

)
@lucmd9.ar_cmd(
    pattern="م22$",
    command=("م22", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "قـائـمـة اوامر الصيد :\n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n᯽︙ اختر احدى هذه القوائم\n-( `.اوامر الصيد` ) \n-( `.اوامر التثبيت` ) \n✟ــــــــــــــــــــــــــ♛ــــــــــــــــــــــــــ✟\n⌔︙CH : @angthon"
        )
